; domain
(define (domain drone)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (visited ?x - location)
    )
    (:functions
        (x)
        (y)
        (z)
        (xl ?l - location)
        (yl ?l - location)
        (zl ?l - location)
        (battery-level)
        (battery-level-full)
        (min_x)
        (max_x)
        (min_y)
        (max_y)
        (min_z)
        (max_z)
    )

    (:action increase_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (x) (- (max_x) 1))
        )
        :effect (and (increase (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action decrease_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (x) (+ (min_x) 1))
        )
        :effect (and (decrease (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (y) (- (max_y) 1))
        )
        :effect (and (increase (y) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (y) (+ (min_y) 1))
        )
        :effect (and (decrease (y) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (z) (- (max_z) 1))
        )
        :effect (and (increase (z) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (z) (+ (min_z) 1))
        )
        :effect (and (decrease (z) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action visit
        :parameters (?l - location)
        :precondition (and
            (>= (battery-level) 1)
            (= (xl ?l) (x))
            (= (yl ?l) (y))
            (= (zl ?l) (z))
        )
        :effect (and (visited ?l)
            (decrease (battery-level) 1))
    )

    (:action recharge
        :parameters ()
        :precondition (and
            (= (x) 0)
            (= (y) 0)
            (= (z) 0)
        )
        :effect (and
            (assign (battery-level) (battery-level-full)))
    )

)

; problem
(define (problem name)
	(:domain drone)
	(:objects
		x0y0z0 x0y0z1 - location
	)
	(:init
		(= (max_z) 2.0)
		(= (max_y) 1.0)
		(= (z) 0.0)
		(= (x) 0.0)
		(= (yl x0y0z1) 0.0)
		(= (xl x0y0z0) 0.0)
		(= (battery-level) 9.0)
		(= (min_z) 0.0)
		(= (zl x0y0z0) 0.0)
		(= (zl x0y0z1) 1.0)
		(= (battery-level-full) 9.0)
		(= (xl x0y0z1) 0.0)
		(= (yl x0y0z0) 0.0)
		(= (min_y) 0.0)
		(= (y) 0.0)
		(= (max_x) 1.0)
		(= (min_x) 0.0)
	)
	(:goal
			(and
				(visited x0y0z0)
				(visited x0y0z1)
				(= (x) 0.0)
				(= (y) 0.0)
				(= (z) 0.0)
			)
	)
)

; plan
1. (increase_z)
   changed: (z) from 0 to 1, (battery-level) from 9 to 8
   goals met: 2 of 5
2. (visit x0y0z1)
   added: (visited x0y0z1)
   changed: (battery-level) from 8 to 7
   goals met: 3 of 5
3. (decrease_z)
   changed: (z) from 1 to 0, (battery-level) from 7 to 6
   goals met: 4 of 5
4. (visit x0y0z0)
   added: (visited x0y0z0)
   changed: (battery-level) from 6 to 5
   goals met: 5 of 5
